In [1]:
import pandas as pd
import numpy as np

data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)

"""
Write a function that takes dataframe df (defined above) and string with 
animal as inputs and returns rows where animal is equal to string (parameter function)
and age is less than 3.

Notes:
        - Return empty DataFrame if wrong animal is written
"""

'\nWrite a function that takes dataframe df (defined above) and string with animal as inputs and returns rows where animal is equal to string (parameter function) and age is less than 3.\n\nNotes:\n        - Return empty DataFrame if wrong animal is written\n'

In [38]:
def filter_animals(df,animal):
    for i in list(df['animal']):
        return df[(df['animal'] == animal) & (df['age']< 3)]

In [2]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [21]:
df[(df['animal'] == 'cat') & (df['age']< 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [41]:
filter_animals(df, 'snake')

  animal  age  visits priority
c  snake  0.5       2       no

In [34]:
for animal in list(df['animal'])

SyntaxError: invalid syntax (<ipython-input-34-fdd739660315>, line 1)

In [105]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

df = pd.DataFrame(data, index=labels)

"""
Write a function that takes dataframe df (defined above) as input and returns filtered dataframe with:
        - Only numeric columns
        - Only rows without any missing values

Notes:
        - Donâ€™t select the columns and rows manually (use filtering)
"""

'\nWrite a function that takes dataframe df (defined above) as input and returns filtered dataframe with:\n        - Only numeric columns\n        - Only rows without any missing values\n\nNotes:\n        - Donâ€™t select the columns and rows manually (use filtering)\n'

  animal  age  visits priority  age  visits
a    cat  2.5     1.0      yes  2.5       1
b    cat  3.0     3.0      yes  3.0       3
c  snake  0.5     2.0       no  0.5       2
e    dog  5.0     2.0       no  5.0       2
f    cat  2.0     3.0       no  2.0       3
g  snake  4.5     1.0       no  4.5       1
i    dog  7.0     2.0       no  7.0       2
j    dog  3.0     1.0       no  3.0       1
d    NaN  NaN     NaN      NaN  NaN       3
h    NaN  NaN     NaN      NaN  NaN       1

In [64]:
(df.loc['h']== 'NaN')

animal      False
age         False
visits      False
priority    False
Name: h, dtype: bool

In [68]:
df[df['age'].isnull() == False]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
i    dog  7.0       2       no
j    dog  3.0       1       no

In [77]:
list(df.columns)

['animal', 'age', 'visits', 'priority']

In [90]:
df[df['age'].isnull() == False]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
i    dog  7.0       2       no
j    dog  3.0       1       no

In [91]:
df.select_dtypes(include='number')

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
d  NaN       3
e  5.0       2
f  2.0       3
g  4.5       1
h  NaN       1
i  7.0       2
j  3.0       1

In [103]:
df.dropna(subset = ["age"], inplace=True)

In [107]:
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [111]:
def filter_dataframe(df):
   # for i in list(df.columns) 
    x = df.dropna(subset = ["age"], inplace=True)
    y = df.select_dtypes(include='number')
    return pd.concat([x, y], axis=1)

In [112]:
filter_dataframe(df)

   age  visits
a  2.5       1
b  3.0       3
c  0.5       2
e  5.0       2
f  2.0       3
g  4.5       1
i  7.0       2
j  3.0       1

In [110]:
df.dropna(subset = ["age"], inplace=True)

In [195]:
#Create a Dictionary of series
d = {'Name':pd.Series(['Andres','James','David','Vin','Steve','David','Jack',
   'Lee','David','Gasper','Betina','Andres']),
   'Age':pd.Series([25,26,25,23,30,29,23,34,40,30,51,46]),
   'Rating':pd.Series([4.23,3.24,3.98,2.56,3.20,4.6,3.8,3.78,2.98,4.80,4.10,3.65])
}

#Create a DataFrame
df = pd.DataFrame(d)

"""
Write a function that takes df (defined above) as input and returns tuple with 3 values:
   - Most common name (string)
   - Average age (float)
   - IQR of rating (float)

Notes:
   - Average age and IQR must be float not numpy.float64 type
"""

'\nWrite a function that takes df (defined above) as input and returns tuple with 3 values:\n   - Most common name (string)\n   - Average age (float)\n   - IQR of rating (float)\n\nNotes:\n   - Average age and IQR must be float not numpy.float64 type\n'

In [196]:
df

      Name  Age  Rating
0   Andres   25    4.23
1    James   26    3.24
2    David   25    3.98
3      Vin   23    2.56
4    Steve   30    3.20
5    David   29    4.60
6     Jack   23    3.80
7      Lee   34    3.78
8    David   40    2.98
9   Gasper   30    4.80
10  Betina   51    4.10
11  Andres   46    3.65

In [185]:
df['Name'].unique()

array(['Andres', 'James', 'David', 'Vin', 'Steve', 'Jack', 'Lee',
       'Gasper', 'Betina'], dtype=object)

In [206]:
def compute_statistics(df):
    q75, q25 = np.percentile(df['Rating'], [75 ,25])
    iqr = q75 - q25
    IQR = float(iqr)
    x = df['Name'].value_counts(sort = True).index.tolist()[0]
    Name = str(x)
    avg_age = df['Age'].sum()/df['Age'].count()
    Avg_Age = float(avg_age)
    return Name, IQR, Avg_Age

In [209]:
compute_statistics(df)

('David', 0.9024999999999999, 31.833333333333332)

In [205]:
y = df['Name'].value_counts(sort = True).index.tolist()[0]
y

'David'

In [118]:
q75, q25 = np.percentile(df['Rating'], [75 ,25])
iqr = q75 - q25
type(float(iqr))

float

In [155]:
def compute_statistics(df):
    q75, q25 = np.percentile(df['Rating'], [75 ,25])
    iqr = q75 - q25
    IQR = float(iqr)
    x = df['Name'].value_counts(sort = True).head(1)
    Name = str(x)
    avg_age = df['Age'].sum()/df['Age'].count()
    Avg_Age = float(avg_age)
    return Name, IQR, Avg_Age

In [156]:
compute_statistics(df)

('David    3\nName: Name, dtype: int64',
 0.9024999999999999,
 31.833333333333332)

In [176]:
x = df['Name'].value_counts(sort = True).head(1)
x

David    3
Name: Name, dtype: int64

In [139]:
type(x)

pandas.core.series.Series

In [144]:
str(x)

'David    3\nName: Name, dtype: int64'

In [153]:
avg_age = df['Age'].sum()/df['Age'].count()

In [150]:
df['Age'].count()

12

In [154]:
type(avg_age)

numpy.float64

In [173]:
"""
 - Connect to the hr.db (stored in supporting-files directory) with sqlite3 
 - Write a query to find the names (first_name, last_name) of the employees who have a 
 manager who works for a department based in the United States. 
 

Expected columns:
    - first_name	
    - last_name	
    - manager_od

Notes:
    - Use tables employees, departments and locations
    - You shouldnâ€™t use JOINs here. 
    - You can connect to DB from Jupyter Lab/Notebook, explore the table and try different queries
    - In the variable 'SQL' store only the final query ready for validation 
"""


SQL = "IMPLEMENT ME"

In [186]:
import sqlite3
import pandas as pd

In [193]:
# create connection
conn = sqlite3.connect("hr.db")

# all data from db
df_all = pd.read_sql("""SELECT 
                            name
                        FROM sqlite_master 
                        WHERE type ='table' 
                            AND name NOT LIKE 'sqlite_%';
                     """, conn
                    )

In [194]:
df_departments = pd.read_sql("""SELECT *
                        FROM departments
                     """, conn
                    )

DatabaseError: Execution failed on sql 'SELECT *
                        FROM departments
                     ': no such table: departments

In [171]:
df_all

Empty DataFrame
Columns: [name]
Index: []

In [191]:
df_departments = pd.read_sql("""SELECT *
                        FROM employees;
                     """, conn
                    )

DatabaseError: Execution failed on sql 'SELECT *
                        FROM employees;
                     ': no such table: employees

In [192]:
df_all

Empty DataFrame
Columns: [name]
Index: []